# pandas小白教程

## 创建Series

In [2]:
import pandas as pd
s1 = pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
s2 = pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
s2

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [4]:
s3 = pd.Series([1,1.5,2,8])
s3

0    1.0
1    1.5
2    2.0
3    8.0
dtype: float64

In [5]:
import numpy as np
s4 = pd.Series([1,2,3,np.nan])
s4

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [6]:
s5 = pd.Series('python', index=['a','b','c'])#单一内容自动重复填充
s5

a    python
b    python
c    python
dtype: object

In [7]:
s6 = pd.Series({'a':1,'b':2,'c':3})#字典方式创建序列
s6

a    1
b    2
c    3
dtype: int64

## 创建DataFrame

In [8]:
df = pd.DataFrame({'A':5,
                  'B':[2,3,4,5],
                  'C':pd.Series([5,6,7,8]),
                  'D':np.array([15,3,5,8])})#字典方式创建表格
df

   A  B  C   D
0  5  2  5  15
1  5  3  6   3
2  5  4  7   5
3  5  5  8   8

In [9]:
df = pd.DataFrame({'A':5,
                  'B':[2,3,4,5],
                  'C':pd.Series([5,6,7,8]),
                  'D':np.array([15,3,5,8])}, index=['a','b','c','d'])#字典方式创建表格并指定行索引
df

   A  B   C   D
a  5  2 NaN  15
b  5  3 NaN   3
c  5  4 NaN   5
d  5  5 NaN   8

In [10]:
df = pd.DataFrame({'A':5,
                  'B':[2,3,4,5],
                  'C':pd.Series([5,6,7,8],index=['a','b','c','d']),#因为Series的默认行索引是从零开始的数字，故这里需重新指定
                  'D':np.array([15,3,5,8])}, index=['a','b','c','d'])
df

   A  B  C   D
a  5  2  5  15
b  5  3  6   3
c  5  4  7   5
d  5  5  8   8

In [11]:
data = np.arange(81).reshape(9,9)
index = ['一','二','三','四','五','六','七','八','九']
columns = ['甲','乙','丙','丁','戊','己','庚','辛','壬'] 
df = pd.DataFrame(data, index=index, columns=columns)#添加内容、指定行索引和列索引
df

    甲   乙   丙   丁   戊   己   庚   辛   壬
一   0   1   2   3   4   5   6   7   8
二   9  10  11  12  13  14  15  16  17
三  18  19  20  21  22  23  24  25  26
四  27  28  29  30  31  32  33  34  35
五  36  37  38  39  40  41  42  43  44
六  45  46  47  48  49  50  51  52  53
七  54  55  56  57  58  59  60  61  62
八  63  64  65  66  67  68  69  70  71
九  72  73  74  75  76  77  78  79  80

## 查看数据

In [12]:
df.head()#默认位前五行

    甲   乙   丙   丁   戊   己   庚   辛   壬
一   0   1   2   3   4   5   6   7   8
二   9  10  11  12  13  14  15  16  17
三  18  19  20  21  22  23  24  25  26
四  27  28  29  30  31  32  33  34  35
五  36  37  38  39  40  41  42  43  44

In [13]:
df.head(3)

    甲   乙   丙   丁   戊   己   庚   辛   壬
一   0   1   2   3   4   5   6   7   8
二   9  10  11  12  13  14  15  16  17
三  18  19  20  21  22  23  24  25  26

In [14]:
df.tail()#默认为后五行

    甲   乙   丙   丁   戊   己   庚   辛   壬
五  36  37  38  39  40  41  42  43  44
六  45  46  47  48  49  50  51  52  53
七  54  55  56  57  58  59  60  61  62
八  63  64  65  66  67  68  69  70  71
九  72  73  74  75  76  77  78  79  80

In [15]:
df.tail(3)

    甲   乙   丙   丁   戊   己   庚   辛   壬
七  54  55  56  57  58  59  60  61  62
八  63  64  65  66  67  68  69  70  71
九  72  73  74  75  76  77  78  79  80

In [16]:
df.index#获取行索引

Index(['一', '二', '三', '四', '五', '六', '七', '八', '九'], dtype='object')

In [17]:
df.columns#获取列索引

Index(['甲', '乙', '丙', '丁', '戊', '己', '庚', '辛', '壬'], dtype='object')

In [18]:
df.dtypes#获取每列数据类型

甲    int32
乙    int32
丙    int32
丁    int32
戊    int32
己    int32
庚    int32
辛    int32
壬    int32
dtype: object

In [19]:
df.values#获取表格内容

array([[ 0,  1,  2,  3,  4,  5,  6,  7,  8],
       [ 9, 10, 11, 12, 13, 14, 15, 16, 17],
       [18, 19, 20, 21, 22, 23, 24, 25, 26],
       [27, 28, 29, 30, 31, 32, 33, 34, 35],
       [36, 37, 38, 39, 40, 41, 42, 43, 44],
       [45, 46, 47, 48, 49, 50, 51, 52, 53],
       [54, 55, 56, 57, 58, 59, 60, 61, 62],
       [63, 64, 65, 66, 67, 68, 69, 70, 71],
       [72, 73, 74, 75, 76, 77, 78, 79, 80]])

In [20]:
df.describe()#总体描述表格

,甲,乙,丙,丁,戊,己,庚,辛,壬
count,9.000000,9.000000,9.000000,9.000000,9.000000,9.000000,9.000000,9.000000,9.000000
mean,36.000000,37.000000,38.000000,39.000000,40.000000,41.000000,42.000000,43.000000,44.000000
std,24.647515,24.647515,24.647515,24.647515,24.647515,24.647515,24.647515,24.647515,24.647515
min,0.000000,1.000000,2.000000,3.000000,4.000000,5.000000,6.000000,7.000000,8.000000
25%,18.000000,19.000000,20.000000,21.000000,22.000000,23.000000,24.000000,25.000000,26.000000
50%,36.000000,37.000000,38.000000,39.000000,40.000000,41.000000,42.000000,43.000000,44.000000
75%,54.000000,55.000000,56.000000,57.000000,58.000000,59.000000,60.000000,61.000000,62.000000
max,72.000000,73.000000,74.000000,75.000000,76.000000,77.000000,78.000000,79.000000,80.000000

In [21]:
s = pd.Series([1,2,3])
s.describe()#对序列的总体描述

count    3.0
mean     2.0
std      1.0
min      1.0
25%      1.5
50%      2.0
75%      2.5
max      3.0
dtype: float64

In [22]:
s = pd.Series(['a','b','c','a','c','c','c'])
s.describe()#内容为字符时的总体描述

count     7
unique    3
top       c
freq      4
dtype: object

## 变换DataFrame

In [23]:
df = pd.DataFrame(np.random.randint(1,10,25).reshape(5,5),index=[2,5,8,9,7],columns=[4,9,3,2,5])
df

   4  9  3  2  5
2  8  2  1  5  8
5  6  1  3  4  3
8  1  3  8  7  5
9  2  7  2  2  9
7  5  4  9  4  7

In [24]:
df.T#转置

   2  5  8  9  7
4  8  6  1  2  5
9  2  1  3  7  4
3  1  3  8  2  9
2  5  4  7  2  4
5  8  3  5  9  7

In [25]:
df.sort_index(axis=0)#行索引排列

   4  9  3  2  5
2  8  2  1  5  8
5  6  1  3  4  3
7  5  4  9  4  7
8  1  3  8  7  5
9  2  7  2  2  9

In [26]:
df.sort_index(axis=1)#列索引排列

   2  3  4  5  9
2  5  1  8  8  2
5  4  3  6  3  1
8  7  8  1  5  3
9  2  2  2  9  7
7  4  9  5  7  4

In [27]:
df.sort_index(axis=1,ascending=False)#列索引降序排列

   9  5  4  3  2
2  2  8  8  1  5
5  1  3  6  3  4
8  3  5  1  8  7
9  7  9  2  2  2
7  4  7  5  9  4

In [28]:
df.sort_values(by=2)#数字为2的列从小到大排列

   4  9  3  2  5
9  2  7  2  2  9
5  6  1  3  4  3
7  5  4  9  4  7
2  8  2  1  5  8
8  1  3  8  7  5

In [29]:
df.sort_values(by=2,axis=1)#数字为2的行升序排列

   3  9  2  4  5
2  1  2  5  8  8
5  3  1  4  6  3
8  8  3  7  1  5
9  2  7  2  2  9
7  9  4  4  5  7

In [30]:
df.sort_values(by=2,axis=1,ascending=False)#降序

   4  5  2  9  3
2  8  8  5  2  1
5  6  3  4  1  3
8  1  5  7  3  8
9  2  9  2  7  2
7  5  7  4  4  9

## 选取数据和赋值

### 普通索引和切片

In [31]:
import pandas as pd 
import numpy as np
df = pd.DataFrame(np.arange(25).reshape(5,5),
                 index=list('ABCDE'),
                 columns=list('甲乙丙丁戊'))
df

    甲   乙   丙   丁   戊
A   0   1   2   3   4
B   5   6   7   8   9
C  10  11  12  13  14
D  15  16  17  18  19
E  20  21  22  23  24

In [32]:
df['甲']

A     0
B     5
C    10
D    15
E    20
Name: 甲, dtype: int32

In [33]:
df[['甲','丙']]

    甲   丙
A   0   2
B   5   7
C  10  12
D  15  17
E  20  22

In [34]:
df[0:3]#注意此处是行切片，相当于df.head(3),而且必须是一个范围，df[0]报错

    甲   乙   丙   丁   戊
A   0   1   2   3   4
B   5   6   7   8   9
C  10  11  12  13  14

### loc、iloc、at、iat

In [35]:
df.loc['A']

甲    0
乙    1
丙    2
丁    3
戊    4
Name: A, dtype: int32

In [36]:
df.loc['A':'D']

    甲   乙   丙   丁   戊
A   0   1   2   3   4
B   5   6   7   8   9
C  10  11  12  13  14
D  15  16  17  18  19

In [37]:
df.loc['A':'D','乙']

A     1
B     6
C    11
D    16
Name: 乙, dtype: int32

In [38]:
df.loc['A':'D',['甲','丙']]

    甲   丙
A   0   2
B   5   7
C  10  12
D  15  17

In [39]:
df.loc[['A','D']]

    甲   乙   丙   丁   戊
A   0   1   2   3   4
D  15  16  17  18  19

In [40]:
df.iloc[2]

甲    10
乙    11
丙    12
丁    13
戊    14
Name: C, dtype: int32

In [41]:
df.iloc[:3]

    甲   乙   丙   丁   戊
A   0   1   2   3   4
B   5   6   7   8   9
C  10  11  12  13  14

In [42]:
df.iloc[[1,2,4]]

    甲   乙   丙   丁   戊
B   5   6   7   8   9
C  10  11  12  13  14
E  20  21  22  23  24

In [43]:
df.iloc[2,3]#2行3列的值

13

In [44]:
df.at['B','丙']#先行后列，顺序不可调换

7

In [45]:
df.loc['B'].at['丙']

7

In [46]:
df.iat[0,1]#0行1列的值，只能接收整型参数

1

### 布尔索引和数据过滤

In [47]:
df[df>12]

      甲     乙     丙     丁     戊
A   NaN   NaN   NaN   NaN   NaN
B   NaN   NaN   NaN   NaN   NaN
C   NaN   NaN   NaN  13.0  14.0
D  15.0  16.0  17.0  18.0  19.0
E  20.0  21.0  22.0  23.0  24.0

In [48]:
df[df['甲']>10]

    甲   乙   丙   丁   戊
D  15  16  17  18  19
E  20  21  22  23  24

In [49]:
df['丁'].isin([13,23])

A    False
B    False
C     True
D    False
E     True
Name: 丁, dtype: bool

In [50]:
df[df['丁'].isin([13,23])]

    甲   乙   丙   丁   戊
C  10  11  12  13  14
E  20  21  22  23  24

### 赋值

In [51]:
df

    甲   乙   丙   丁   戊
A   0   1   2   3   4
B   5   6   7   8   9
C  10  11  12  13  14
D  15  16  17  18  19
E  20  21  22  23  24

In [52]:
df['甲']='赋值'
df

    甲   乙   丙   丁   戊
A  赋值   1   2   3   4
B  赋值   6   7   8   9
C  赋值  11  12  13  14
D  赋值  16  17  18  19
E  赋值  21  22  23  24

## 数据处理

In [53]:
import pandas as pd 
import numpy as np 
df = pd.DataFrame(np.random.randint(36,size=(6,6)),index=list('abcdef'))
df.iloc[[1,2,4],4]=np.nan
df

    0   1   2   3     4   5
a  13  31   8  27  25.0  26
b  22   0   4  16   NaN  21
c  12  20   6   2   NaN   5
d  27  18   9  15   0.0  17
e   3  18  25  35   NaN   9
f  10   3   3  15  31.0   0

In [54]:
new_index = ['a','b','c','d','e','g']
df.reindex(index=new_index)

      0     1     2     3     4     5
a  13.0  31.0   8.0  27.0  25.0  26.0
b  22.0   0.0   4.0  16.0   NaN  21.0
c  12.0  20.0   6.0   2.0   NaN   5.0
d  27.0  18.0   9.0  15.0   0.0  17.0
e   3.0  18.0  25.0  35.0   NaN   9.0
g   NaN   NaN   NaN   NaN   NaN   NaN

In [55]:
df.reindex(new_index,axis='index')

      0     1     2     3     4     5
a  13.0  31.0   8.0  27.0  25.0  26.0
b  22.0   0.0   4.0  16.0   NaN  21.0
c  12.0  20.0   6.0   2.0   NaN   5.0
d  27.0  18.0   9.0  15.0   0.0  17.0
e   3.0  18.0  25.0  35.0   NaN   9.0
g   NaN   NaN   NaN   NaN   NaN   NaN

In [56]:
df.reindex(columns=[0,1,2,3,4,6])

    0   1   2   3     4   6
a  13  31   8  27  25.0 NaN
b  22   0   4  16   NaN NaN
c  12  20   6   2   NaN NaN
d  27  18   9  15   0.0 NaN
e   3  18  25  35   NaN NaN
f  10   3   3  15  31.0 NaN

In [57]:
df.reindex(index =list('abcd'),columns=[0,2,5])

    0  2   5
a  13  8  26
b  22  4  21
c  12  6   5
d  27  9  17

In [58]:
df1 = df.reindex(columns=range(7))
df1[7]=1
df1

    0   1   2   3     4   5   6  7
a  13  31   8  27  25.0  26 NaN  1
b  22   0   4  16   NaN  21 NaN  1
c  12  20   6   2   NaN   5 NaN  1
d  27  18   9  15   0.0  17 NaN  1
e   3  18  25  35   NaN   9 NaN  1
f  10   3   3  15  31.0   0 NaN  1

In [59]:
df.reindex(index=new_index,fill_value='缺失值')

     0    1    2    3    4    5
a   13   31    8   27   25   26
b   22    0    4   16  NaN   21
c   12   20    6    2  NaN    5
d   27   18    9   15    0   17
e    3   18   25   35  NaN    9
g  缺失值  缺失值  缺失值  缺失值  缺失值  缺失值

In [60]:
df

    0   1   2   3     4   5
a  13  31   8  27  25.0  26
b  22   0   4  16   NaN  21
c  12  20   6   2   NaN   5
d  27  18   9  15   0.0  17
e   3  18  25  35   NaN   9
f  10   3   3  15  31.0   0

In [61]:
df.fillna(6)

    0   1   2   3     4   5
a  13  31   8  27  25.0  26
b  22   0   4  16   6.0  21
c  12  20   6   2   6.0   5
d  27  18   9  15   0.0  17
e   3  18  25  35   6.0   9
f  10   3   3  15  31.0   0

In [62]:
df.fillna({4:'python'})

    0   1   2   3       4   5
a  13  31   8  27      25  26
b  22   0   4  16  python  21
c  12  20   6   2  python   5
d  27  18   9  15       0  17
e   3  18  25  35  python   9
f  10   3   3  15      31   0

In [63]:
df.fillna(method='bfill')

    0   1   2   3     4   5
a  13  31   8  27  25.0  26
b  22   0   4  16   0.0  21
c  12  20   6   2   0.0   5
d  27  18   9  15   0.0  17
e   3  18  25  35  31.0   9
f  10   3   3  15  31.0   0

In [64]:
df.fillna(method='ffill')#与method='pad'相同

    0   1   2   3     4   5
a  13  31   8  27  25.0  26
b  22   0   4  16  25.0  21
c  12  20   6   2  25.0   5
d  27  18   9  15   0.0  17
e   3  18  25  35   0.0   9
f  10   3   3  15  31.0   0

In [65]:
df.fillna(method='ffill',limit=1)

    0   1   2   3     4   5
a  13  31   8  27  25.0  26
b  22   0   4  16  25.0  21
c  12  20   6   2   NaN   5
d  27  18   9  15   0.0  17
e   3  18  25  35   0.0   9
f  10   3   3  15  31.0   0

In [66]:
df.fillna(method='ffill',axis=1)

      0     1     2     3     4     5
a  13.0  31.0   8.0  27.0  25.0  26.0
b  22.0   0.0   4.0  16.0  16.0  21.0
c  12.0  20.0   6.0   2.0   2.0   5.0
d  27.0  18.0   9.0  15.0   0.0  17.0
e   3.0  18.0  25.0  35.0  35.0   9.0
f  10.0   3.0   3.0  15.0  31.0   0.0

In [67]:
df.isnull()

       0      1      2      3      4      5
a  False  False  False  False  False  False
b  False  False  False  False   True  False
c  False  False  False  False   True  False
d  False  False  False  False  False  False
e  False  False  False  False   True  False
f  False  False  False  False  False  False

## 几个重要的函数

### apply

In [68]:
df

    0   1   2   3     4   5
a  13  31   8  27  25.0  26
b  22   0   4  16   NaN  21
c  12  20   6   2   NaN   5
d  27  18   9  15   0.0  17
e   3  18  25  35   NaN   9
f  10   3   3  15  31.0   0

In [69]:
#每一列的最大值减去最小值
df.apply(lambda x: x.max()-x.min())

0    24.0
1    31.0
2    22.0
3    33.0
4    31.0
5    26.0
dtype: float64

In [70]:
#每一行的最大值减去最小值
df.apply(lambda x: x.max()-x.min(), axis=1)

a    23.0
b    22.0
c    18.0
d    27.0
e    32.0
f    31.0
dtype: float64

### concat

In [71]:
s1 = pd.Series(['a','b','c'])
s2 = pd.Series([4,5,6])
pd.concat([s1,s2])

0    a
1    b
2    c
0    4
1    5
2    6
dtype: object

In [72]:
pd.concat([s1,s2],ignore_index=True)

0    a
1    b
2    c
3    4
4    5
5    6
dtype: object

In [73]:
#为两个Series编号，注意此时ignore_index不能设置为True，否则keys参数无效
pd.concat([s1,s2],keys=['s1','s2'])

s1  0    a
    1    b
    2    c
s2  0    4
    1    5
    2    6
dtype: object

In [74]:
#为Series编号添加名字和添加行索引名称
pd.concat([s1,s2],keys=['s1','s2'],names=['Series','rowid'])

Series  rowid
s1      0        a
        1        b
        2        c
s2      0        4
        1        5
        2        6
dtype: object

In [75]:
df1 = pd.DataFrame([['a','b'],['c','d']],columns=['甲','乙'])
df2 = pd.DataFrame([['e','f'],['g','h']],columns=['甲','乙'])
pd.concat([df1,df2])

   甲  乙
0  a  b
1  c  d
0  e  f
1  g  h

In [76]:
df1 = pd.DataFrame([['a','b'],['c','d']],columns=['甲','乙'])
df2 = pd.DataFrame([['e','f'],['g','h']],columns=['甲','丙'])
pd.concat([df1,df2])

     丙    乙  甲
0  NaN    b  a
1  NaN    d  c
0    f  NaN  e
1    h  NaN  g

In [77]:
pd.concat([df1,df2],join='inner')#可认为是把有缺失值的那一列排除

   甲
0  a
1  c
0  e
1  g

In [78]:
#左右堆叠
pd.concat([df1,df2],axis=1)

   甲  乙  甲  丙
0  a  b  e  f
1  c  d  g  h

In [79]:
#不允许有重复的索引值，如果verify_integrity设置为True则报错
pd.concat([df1,df2],verify_integrity=True)

ValueError: Indexes have overlapping values: [0, 1]

### groupby

In [80]:
import pandas as pd
df = pd.DataFrame({'性别':['男','女','男','男','女','女'],
              '年龄':[17,18,18,19,17,18],
              '工资':[2200,3000,4000,3000,5000,1500]})
df

     工资  年龄 性别
0  2200  17  男
1  3000  18  女
2  4000  18  男
3  3000  19  男
4  5000  17  女
5  1500  18  女

In [81]:
df.groupby('性别').sum()

      工资  年龄
性别
女   9500  53
男   9200  54

In [82]:
df.groupby(['性别','年龄']).sum()

         工资
性别 年龄
女  17  5000
   18  4500
男  17  2200
   18  4000
   19  3000

In [83]:
df.groupby(['性别','年龄']).mean()

         工资
性别 年龄
女  17  5000
   18  2250
男  17  2200
   18  4000
   19  3000

### append

In [84]:
df

     工资  年龄 性别
0  2200  17  男
1  3000  18  女
2  4000  18  男
3  3000  19  男
4  5000  17  女
5  1500  18  女

In [85]:
df.iloc[2]

工资    4000
年龄      18
性别       男
Name: 2, dtype: object

In [86]:
df.append(df.iloc[2],ignore_index=True)

     工资  年龄 性别
0  2200  17  男
1  3000  18  女
2  4000  18  男
3  3000  19  男
4  5000  17  女
5  1500  18  女
6  4000  18  男

In [87]:
df

     工资  年龄 性别
0  2200  17  男
1  3000  18  女
2  4000  18  男
3  3000  19  男
4  5000  17  女
5  1500  18  女

In [88]:
df.append(df.iloc[2:4],ignore_index=True)

     工资  年龄 性别
0  2200  17  男
1  3000  18  女
2  4000  18  男
3  3000  19  男
4  5000  17  女
5  1500  18  女
6  4000  18  男
7  3000  19  男

### merge

In [146]:
df1 = pd.DataFrame({'A':['a','b','c'],'B':[4,5,6]})
df2 = pd.DataFrame({'A':['a','b','c'],'C':[7,8,9]})

In [90]:
df1.merge(df2,on='A')

   A  B  C
0  a  4  7
1  b  5  8
2  c  6  9

In [91]:
pd.concat([df1,df2])

   A    B    C
0  a  4.0  NaN
1  b  5.0  NaN
2  c  6.0  NaN
0  a  NaN  7.0
1  b  NaN  8.0
2  c  NaN  9.0

In [92]:
df3 = pd.DataFrame({'A':['a','b','c'],'B':[4,5,6]})
df4 = pd.DataFrame({'A':['a','b','d'],'C':[7,8,9]})
pd.merge(df3,df4,on='A')

   A  B  C
0  a  4  7
1  b  5  8

In [93]:
df3.merge(df4,on='A',how='outer')

   A    B    C
0  a  4.0  7.0
1  b  5.0  8.0
2  c  6.0  NaN
3  d  NaN  9.0

In [94]:
df3.merge(df4,on='A',how='left')

   A  B    C
0  a  4  7.0
1  b  5  8.0
2  c  6  NaN

In [95]:
df3.merge(df4,on='A',how='right')

   A    B  C
0  a  4.0  7
1  b  5.0  8
2  d  NaN  9

### pivot_table

In [96]:
df = pd.DataFrame({'班级':['一班','二班','三班','一班','三班','二班','一班','二班','二班','三班'],
                  '性别':['男','女','男','男','女','男','女','女','男','女'],
                  '身高':[156,177,169,186,176,156,155,148,196,174],
                  '体重':[46,47,52,62,59,67,78,85,76,52]})
df

   体重 性别  班级   身高
0  46  男  一班  156
1  47  女  二班  177
2  52  男  三班  169
3  62  男  一班  186
4  59  女  三班  176
5  67  男  二班  156
6  78  女  一班  155
7  85  女  二班  148
8  76  男  二班  196
9  52  女  三班  174

In [97]:
import numpy as np
pd.pivot_table(df,values=['身高','体重'],index=['班级','性别'],aggfunc=np.mean)

         体重     身高
班级 性别
一班 女   78.0  155.0
   男   54.0  171.0
三班 女   55.5  175.0
   男   52.0  169.0
二班 女   66.0  162.5
   男   71.5  176.0

In [98]:
pd.pivot_table(df,values=['身高','体重'],index=['班级','性别'],aggfunc={'身高':np.mean,'体重':np.sum})

        体重     身高
班级 性别
一班 女    78  155.0
   男   108  171.0
三班 女   111  175.0
   男    52  169.0
二班 女   132  162.5
   男   143  176.0

### 其它

In [99]:
s = pd.Series([1,2,2,3,6,2,1,7,7,'a','b',2,1,3,6,2])
s.value_counts()

2    5
1    3
7    2
6    2
3    2
b    1
a    1
dtype: int64

In [100]:
s = pd.Series(['c','v','98'])
s.str.cat()

'cv98'

In [101]:
s = pd.Series([2,1,4,'c','v','9'])
s.str.upper()

0    NaN
1    NaN
2    NaN
3      C
4      V
5      9
dtype: object

## 时间处理

### date_range

In [102]:
import pandas as pd 
pd.date_range(start='14/9/2018',end='20/9/2018')

DatetimeIndex(['2018-09-14', '2018-09-15', '2018-09-16', '2018-09-17',
               '2018-09-18', '2018-09-19', '2018-09-20'],
              dtype='datetime64[ns]', freq='D')

In [103]:
pd.date_range(start='2018/9/14',end='2018-9-20')

DatetimeIndex(['2018-09-14', '2018-09-15', '2018-09-16', '2018-09-17',
               '2018-09-18', '2018-09-19', '2018-09-20'],
              dtype='datetime64[ns]', freq='D')

In [104]:
pd.date_range(start='14/9/2018',periods=7)

DatetimeIndex(['2018-09-14', '2018-09-15', '2018-09-16', '2018-09-17',
               '2018-09-18', '2018-09-19', '2018-09-20'],
              dtype='datetime64[ns]', freq='D')

In [105]:
pd.date_range(start='14/9/2018',end='20/9/2018',freq='H')

DatetimeIndex(['2018-09-14 00:00:00', '2018-09-14 01:00:00',
               '2018-09-14 02:00:00', '2018-09-14 03:00:00',
               '2018-09-14 04:00:00', '2018-09-14 05:00:00',
               '2018-09-14 06:00:00', '2018-09-14 07:00:00',
               '2018-09-14 08:00:00', '2018-09-14 09:00:00',
               ...
               '2018-09-19 15:00:00', '2018-09-19 16:00:00',
               '2018-09-19 17:00:00', '2018-09-19 18:00:00',
               '2018-09-19 19:00:00', '2018-09-19 20:00:00',
               '2018-09-19 21:00:00', '2018-09-19 22:00:00',
               '2018-09-19 23:00:00', '2018-09-20 00:00:00'],
              dtype='datetime64[ns]', length=145, freq='H')

In [106]:
pd.date_range(start='14/9/2018',end='20/9/2018',freq='2H')

DatetimeIndex(['2018-09-14 00:00:00', '2018-09-14 02:00:00',
               '2018-09-14 04:00:00', '2018-09-14 06:00:00',
               '2018-09-14 08:00:00', '2018-09-14 10:00:00',
               '2018-09-14 12:00:00', '2018-09-14 14:00:00',
               '2018-09-14 16:00:00', '2018-09-14 18:00:00',
               '2018-09-14 20:00:00', '2018-09-14 22:00:00',
               '2018-09-15 00:00:00', '2018-09-15 02:00:00',
               '2018-09-15 04:00:00', '2018-09-15 06:00:00',
               '2018-09-15 08:00:00', '2018-09-15 10:00:00',
               '2018-09-15 12:00:00', '2018-09-15 14:00:00',
               '2018-09-15 16:00:00', '2018-09-15 18:00:00',
               '2018-09-15 20:00:00', '2018-09-15 22:00:00',
               '2018-09-16 00:00:00', '2018-09-16 02:00:00',
               '2018-09-16 04:00:00', '2018-09-16 06:00:00',
               '2018-09-16 08:00:00', '2018-09-16 10:00:00',
               '2018-09-16 12:00:00', '2018-09-16 14:00:00',
               '2018-09-16 16:00:00', '2018-09-16 18:00:00',
               '2018-09-16 20:00:00', '2018-09-16 22:00:00',
               '2018-09-17 00:00:00', '2018-09-17 02:00:00',
               '2018-09-17 04:00:00', '2018-09-17 06:00:00',
               '2018-09-17 08:00:00', '2018-09-17 10:00:00',
               '2018-09-17 12:00:00', '2018-09-17 14:00:00',
               '2018-09-17 16:00:00', '2018-09-17 18:00:00',
               '2018-09-17 20:00:00', '2018-09-17 22:00:00',
               '2018-09-18 00:00:00', '2018-09-18 02:00:00',
               '2018-09-18 04:00:00', '2018-09-18 06:00:00',
               '2018-09-18 08:00:00', '2018-09-18 10:00:00',
               '2018-09-18 12:00:00', '2018-09-18 14:00:00',
               '2018-09-18 16:00:00', '2018-09-18 18:00:00',
               '2018-09-18 20:00:00', '2018-09-18 22:00:00',
               '2018-09-19 00:00:00', '2018-09-19 02:00:00',
               '2018-09-19 04:00:00', '2018-09-19 06:00:00',
               '2018-09-19 08:00:00', '2018-09-19 10:00:00',
               '2018-09-19 12:00:00', '2018-09-19 14:00:00',
               '2018-09-19 16:00:00', '2018-09-19 18:00:00',
               '2018-09-19 20:00:00', '2018-09-19 22:00:00',
               '2018-09-20 00:00:00'],
              dtype='datetime64[ns]', freq='2H')

In [107]:
pd.date_range(start='14/9/2018',end='20/9/2018',freq='2D2H')

DatetimeIndex(['2018-09-14 00:00:00', '2018-09-16 02:00:00',
               '2018-09-18 04:00:00'],
              dtype='datetime64[ns]', freq='50H')

In [108]:
pd.date_range(start='14/9/2018',end='20/9/2018',freq='B')

DatetimeIndex(['2018-09-14', '2018-09-17', '2018-09-18', '2018-09-19',
               '2018-09-20'],
              dtype='datetime64[ns]', freq='B')

In [109]:
pd.date_range(start='14/9/2018',end='20/9/2018',freq='W')

DatetimeIndex(['2018-09-16'], dtype='datetime64[ns]', freq='W-SUN')

In [110]:
pd.date_range(start='14/9/2018',end='20/9/2018',tz='Asia/Shanghai')

DatetimeIndex(['2018-09-14 00:00:00+08:00', '2018-09-15 00:00:00+08:00',
               '2018-09-16 00:00:00+08:00', '2018-09-17 00:00:00+08:00',
               '2018-09-18 00:00:00+08:00', '2018-09-19 00:00:00+08:00',
               '2018-09-20 00:00:00+08:00'],
              dtype='datetime64[ns, Asia/Shanghai]', freq='D')

In [111]:
pd.date_range(start='14/9/2018',end='20/9/2018',closed='left')

DatetimeIndex(['2018-09-14', '2018-09-15', '2018-09-16', '2018-09-17',
               '2018-09-18', '2018-09-19'],
              dtype='datetime64[ns]', freq='D')

In [112]:
pd.date_range(start='14/9/2018',end='20/9/2018',closed='right')

DatetimeIndex(['2018-09-15', '2018-09-16', '2018-09-17', '2018-09-18',
               '2018-09-19', '2018-09-20'],
              dtype='datetime64[ns]', freq='D')

### Timestamp

In [113]:
pd.Timestamp('2018-9-14')

Timestamp('2018-09-14 00:00:00')

In [114]:
pd.Timestamp(year=2018,month=9,day=14,hour=15)

Timestamp('2018-09-14 15:00:00')

In [115]:
pd.Timestamp(2018,9,14,15,13,25,14)

Timestamp('2018-09-14 15:13:25.000014')

In [116]:
pd.Timestamp('2018-9-14')-pd.Timestamp('2018-9-12')

Timedelta('2 days 00:00:00')

In [117]:
pd.Timestamp('2018-9-14')-pd.Timestamp('2018-9-16')

Timedelta('-2 days +00:00:00')

In [118]:
pd.Timestamp(1500,1,18)

OutOfBoundsDatetime: Out of bounds nanosecond timestamp: 1500-01-18 00:00:00

In [119]:
pd.Timestamp.min

Timestamp('1677-09-21 00:12:43.145225')

In [120]:
pd.Timestamp.max

Timestamp('2262-04-11 23:47:16.854775807')

In [121]:
df_time = pd.DataFrame({'year':[2017,2018],
                        'month':[8,11],
                        'day':[12,3]})
df_time

   day  month  year
0   12      8  2017
1    3     11  2018

In [122]:
pd.to_datetime(df_time)                                 #year,month等参数不可变，时间必须合法(比如2月30日为非法时间)，否则报错

0   2017-08-12
1   2018-11-03
dtype: datetime64[ns]

In [123]:
pd.to_datetime('201808041235')

Timestamp('2018-08-04 12:35:00')

In [124]:
pd.to_datetime('20180804',format='%Y%m%d')                          #解析年日月，存在时分秒等报错

Timestamp('2018-08-04 00:00:00')

In [125]:
pd.to_datetime('201808041235',format='%Y%m%d')

ValueError: unconverted data remains: 1235

In [126]:
type(pd.to_datetime('201808041235', format='%Y%m%d',errors='ignore'))

str

In [127]:
pd.to_datetime('201808041235', format='%Y%m%d',errors='coerce')

NaT

In [128]:
import pandas as pd 
pd.to_datetime('20181221',exact=False)

Timestamp('2018-12-21 00:00:00')

In [129]:
pd.to_datetime('1435488505',unit='s')

Timestamp('2015-06-28 10:48:25')

In [130]:
pd.to_datetime(1435488505,unit='s')

Timestamp('2015-06-28 10:48:25')

In [131]:
pd.to_datetime(1,unit='D')

Timestamp('1970-01-02 00:00:00')

In [132]:
pd.to_datetime(['1','2'],unit='D')#距离1970年1、2天

DatetimeIndex(['1970-01-02', '1970-01-03'], dtype='datetime64[ns]', freq=None)

In [133]:
pd.to_datetime([1,2], unit='D',origin=pd.Timestamp('2018-8-8'))#此处要注意1不能为字符串类型

DatetimeIndex(['2018-08-09', '2018-08-10'], dtype='datetime64[ns]', freq=None)

In [134]:
pd.to_datetime('101112',yearfirst=True)#年优先

Timestamp('2010-11-12 00:00:00')

In [135]:
pd.to_datetime('101112',dayfirst=True)#日优先

Timestamp('2012-11-10 00:00:00')

In [136]:
pd.to_datetime('20180808')#返回时间戳

Timestamp('2018-08-08 00:00:00')

In [137]:
pd.to_datetime('20180808',box=False)#返回数组

numpy.datetime64('2018-08-08T00:00:00.000000000')

## 文件读取

### csv

In [138]:
import pandas as pd
df = pd.DataFrame({'A':['a','b','c','d'],
                  'B':['e','f','g','h']})
df.to_csv('C:/Users/Admin/Desktop/first.csv')

In [139]:
df.to_csv('C:/Users/Admin/Desktop/second.csv',sep='\t')

In [140]:
pd.read_csv('C:/Users/Admin/Desktop/first.csv')

   Unnamed: 0  A  B
0           0  a  e
1           1  b  f
2           2  c  g
3           3  d  h

In [141]:
pd.read_csv('C:/Users/Admin/Desktop/second.csv',sep='\t')

   Unnamed: 0  A  B
0           0  a  e
1           1  b  f
2           2  c  g
3           3  d  h

In [142]:
df = pd.read_csv('C:/Users/Admin/Desktop/second.csv',sep='\t')
df[['A','B']]

   A  B
0  a  e
1  b  f
2  c  g
3  d  h

read_csv其它部分参数

delimiter(str,默认为None): sep的替代参数名称

header：指定行数用来作为列名，如果文件中没有列名，则默认为0，否则设置为None。

如果明确设定header=0就会替换掉原来存在列名。

skipinitialspace(bool,默认为False):是否忽略分隔符后的空白

skiprows(list-like或integer,默认为None)：需要忽略的行数

na_values：用于替换NaN或NA的值

skip_blank_lines(boolean，默认为True)：是否跳过空行，不跳过则填充NaN

encoding：指定数据集类型，通常是"utf-8"

### excel

In [143]:
df = pd.DataFrame({'A':['a','b','c','d'],
                  'B':['e','f','g','h']})
df.to_excel('C:/Users/Admin/Desktop/first.xlsx')

In [144]:
df = pd.read_excel('C:/Users/Admin/Desktop/first.xlsx')
df

   A  B
0  a  e
1  b  f
2  c  g
3  d  h

read_excel其它部分参数

sheet_name：工作表名

use_cols:指定使用的列

header(int或整数列表)：指定行数用来作为列名,默认为0